areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_pwm-d.h
/* Microchip Technology Inc. and its subsidiaries.  You may use this software
 * and any derivatives exclusively with Microchip products.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER
 * EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
 * PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION
 * WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE,
 * INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND
 * WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS
 * BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE
 * FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS
 * IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF
 * ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE
 * TERMS.
 */

/**
 * @file    p33c_pwm-d.h
 * @see     p33c_pwm.h, p33c_pwm-f.h
 * @author  M91406
 * @brief   High-Resolution SMPS PWM Module & Generator Instances register abstraction data type declarations
 * @details
 *  This additional header file contains defines for all required bit-settings of all
 *  related special function registers of a peripheral module and/or instance.
 *  This file is an additional header file on top of the generic device header file.
 */

// This is a guard condition so that contents of this file are not included
// more than once.
#ifndef P33C_PWM_SFR_DECLARATIONS_H
#define	P33C_PWM_SFR_DECLARATIONS_H

// Include standard header files
#include <xc.h> // include processor files - each processor file is guarded.
#include <stdint.h> // include standard integer data types
#include <stdbool.h> // include standard boolean data types
#include <stddef.h> // include standard definition data types

#include "p33c_devices.h" // include extended device identifier macro header file
#include "p33c_pwm-f.h"   // include additional register flag header file

#ifndef __dsPIC33C__
   #error "peripheral driver p33c_pwm.h does not support the selected device"
#endif

// Private arrays of register set start addresses
#if defined (__P33SMPS_OCTANSP__)
static volatile uint16_t* p33c_PwmInstance_Handles[8] = {
    &PG1CONL, &PG2CONL, &PG3CONL, &PG4CONL,
    NULL, &PG6CONL, NULL, &PG8CONL
};
#elif defined (APG4CONL)
static volatile uint16_t* p33c_PwmInstance_Handles[12] = {
    &PG1CONL, &PG2CONL, &PG3CONL, &PG4CONL,
    &PG5CONL, &PG6CONL, &PG7CONL, &PG8CONL,
    &APG1CONL, &APG2CONL, &APG3CONL, &APG4CONL
};
#elif defined (PG8CONL)
static volatile uint16_t* p33c_PwmInstance_Handles[8] = {
    &PG1CONL, &PG2CONL, &PG3CONL, &PG4CONL,
    &PG5CONL, &PG6CONL, &PG7CONL, &PG8CONL
};
#elif defined (PG4CONL)
static volatile uint16_t* p33c_PwmInstance_Handles[4]={
    &PG1CONL, &PG2CONL, &PG3CONL, &PG4CONL
};
#else
#pragma message "selected device has no supported PWM generators"
#endif

/* GENERIC SPECIAL FUNCTION REGISTER (SFR) SETS
 * ============================================
 *
 * Direct addressing of Special Function Registers (SFR) in user code is good
 * enough for a specific application but makes it harder to maintain the code
 * or migrate the code across devices and applications.
 *
 * Especially with complex configurations with multiple dependencies across various
 * peripherals, migrating configurations can become very challenging to review,
 * debug and migrate.
 *
 * Therefore this PWM configuration example uses a 'virtual PWM generator' to set up
 * the required PWM configuration but provides a function allowing users to write this
 * configuration to any PWM generator of choice. Hence, pre-defined configurations
 * can be mapped on specific peripheral instance by using their index defined by the
 * data sheet (e.g. pgInstance = 1 maps pre-defined configuration to PG1)
 *
 * The data types used for each SFR in the P33C_PWM_GENERATOR_t data structure below,
 * are data types declared in the common C-header file of the device (e.g. <d33CK256MP506.h>).
 * These header files are provided with the XC16 C-Compiler installation and don't have to be
 * written nor changed manually.
 *
 */

// ==========================================================
// GENERIC PWM MODULE SPECIAL FUNCTION REGISTER SET
// ==========================================================

#ifndef P33C_PWM_MODULE_s

    /***********************************************************************************
     * @addtogroup p33c-pral-pwm-module-inheritance
     * @extends P33C_PWM_MODULE_s
     * @{
     */

    /**
     * @brief   PWM Clock Control Register inherited from device header file
     */
    union PCLKCON_u {
        struct tagPCLKCONBITS bits; ///< Register bit-field
        uint16_t value;         ///< 16-bit wide register value
    } __attribute__((packed));  ///< PCLKCON: PWM CLOCK CONTROL REGISTER

    /**
     * @brief   PWM Frequency Scaling Register inherited from device header file
     */
    union FSCL_u {
        struct { uint16_t FSCL : 16; } bits; ///< Register bit-field
        uint16_t value;         ///< 16-bit wide register value
    } __attribute__((packed));  ///< FSCL: FREQUENCY SCALE REGISTER

    /**
     * @brief   PWM Frequency Scaling Minimum Period Register inherited from device header file
     */
    union FSMINPER_u {
        struct { uint16_t FSMINPER : 16; } bits; ///< Register bit-field
        uint16_t value;         ///< 16-bit wide register value
    } __attribute__((packed));  ///< FSMINPER: FREQUENCY SCALING MINIMUM PERIOD REGISTER

    /**
     * @brief   PWM Master Phase Register inherited from device header file
     */
    union MPHASE_u {
        struct { uint16_t MPHASE : 16; } bits; ///< Register bit-field
        uint16_t value;         ///< 16-bit wide register value
    } __attribute__((packed));  ///< MPHASE: MASTER PHASE REGISTER

    /**
     * @brief   PWM Master Duty Cycle Register inherited from device header file
     */
    union MDC_u {
        struct { uint16_t MDC : 16; } bits; ///< Register bit-field
        uint16_t value;         ///< 16-bit wide register value
    } __attribute__((packed));  ///< MDC: MASTER DUTY CYCLE REGISTER

    /**
     * @brief   PWM Master Period Register inherited from device header file
     */
    union MPER_u {
        struct { uint16_t MPER : 16; } bits; ///< Register bit-field
        uint16_t value;         ///< 16-bit wide register value
    } __attribute__((packed));  ///< MPER: MASTER PERIOD REGISTER

    /**
     * @brief   PWM Linear Feedback Shift Register inherited from device header file
     */
    union LFSR_u {
        struct tagLFSRBITS bits; ///< Register bit-field
        uint16_t value;          ///< 16-bit wide register value
    } __attribute__((packed));   ///< LFSR: LINEAR FEEDBACK SHIFT REGISTER

    /**
     * @brief   PWM Combinatorial Trigger Register (Low) inherited from device header file
     */
    union CMBTRIGL_u {
        struct tagCMBTRIGLBITS bits; ///< Register bit-field
        uint16_t value;         ///< 16-bit wide register value
    } __attribute__((packed));  ///< CMBTRIGL: COMBINATIONAL TRIGGER REGISTER LOW

    /**
     * @brief   PWM Combinatorial Trigger Register (High) inherited from device header file
     */
    union CMBTRIGH_u {
        struct tagCMBTRIGHBITS bits; ///< Register bit-field
        uint16_t value;         ///< 16-bit wide register value
    } __attribute__((packed));  ///< CMBTRIGH: COMBINATIONAL TRIGGER REGISTER HIGH

    /**
     * @brief   PWM Combinatorial Logic Control Register inherited from device header file
     */
    union LOGCONy_u {
        struct tagLOGCONABITS bits; ///< Register bit-field
        uint16_t value;         ///< 16-bit wide register value
    } __attribute__((packed));  ///< LOGCONy: COMBINATORIAL PWM LOGIC CONTROL REGISTER y

    /**
     * @brief   PWM Event Output Control Register inherited from device header file
     */
    union PWMEVTy_u {
        struct tagPWMEVTABITS bits; ///< Register bit-field
        uint16_t value;         ///< 16-bit wide register value
    } __attribute__((packed));  ///< PWMEVTy: PWM EVENT OUTPUT CONTROL REGISTER y

    /** @} */ // end of inheritance declarations **************************************

