areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_pwm-d.h
    typedef union PCLKCON_u PCLKCON_t;      ///< PCLKCON: PWM CLOCK CONTROL REGISTER data type
    typedef union FSCL_u FSCL_t;            ///< FSCL: FREQUENCY SCALE REGISTER data type
    typedef union FSMINPER_u FSMINPER_t;    ///< FSMINPER: FREQUENCY SCALING MINIMUM PERIOD REGISTER data type
    typedef union MPHASE_u MPHASE_t;        ///< MPHASE: MASTER PHASE REGISTER data type
    typedef union MDC_u MDC_t;              ///< MDC: MASTER DUTY CYCLE REGISTER data type
    typedef union MPER_u MPER_t;            ///< MPER: MASTER PERIOD REGISTER data type
    typedef union LFSR_u LFSR_t;            ///< LFSR: LINEAR FEEDBACK SHIFT REGISTER data type
    typedef union CMBTRIGL_u CMBTRIGL_t;    ///< CMBTRIGL: COMBINATIONAL TRIGGER REGISTER LOW data type
    typedef union CMBTRIGH_u CMBTRIGH_t;    ///< CMBTRIGH: COMBINATIONAL TRIGGER REGISTER HIGH data type
    typedef union LOGCONy_u LOGCONy_t;      ///< LOGCONy: COMBINATORIAL PWM LOGIC CONTROL REGISTER y data type
    typedef union PWMEVTy_u PWMEVTy_t;      ///< PWMEVTy: PWM EVENT OUTPUT CONTROL REGISTER y

    /***********************************************************************************
     * @ingroup p33c-pral-pwm-module-properties
     * @struct  P33C_PWM_MODULE_s
     * @typedef P33C_PWM_MODULE_t
     * @brief   Abstracted set of Special Function Registers of the PWM peripheral module base registers
     * @details
     *  This structure defines an abstracted set of Special Function Registers of
     *  PWM peripheral module base registers. Users can use this abstracted set of
     *  registers to capture register settings from or write generic register
     *  settings to these peripheral base registers.
     *
     **********************************************************************************/

    struct P33C_PWM_MODULE_s {

        PCLKCON_t   PCLKCON;    ///< PCLKCON:     PWM CLOCK CONTROL REGISTER
        FSCL_t      FSCL;       ///< FSCL:        FREQUENCY SCALE REGISTER
        FSMINPER_t  FSMINPER;   ///< FSMINPER:    FREQUENCY SCALING MINIMUM PERIOD REGISTER
        MPHASE_t    MPHASE;     ///< MPHASE:      MASTER PHASE REGISTER
        MDC_t       MDC;        ///< MDC:         MASTER DUTY CYCLE REGISTER
        MPER_t      MPER;       ///< MPER:        MASTER PERIOD REGISTER
        LFSR_t      LFSR;       ///< LFSR:        LINEAR FEEDBACK SHIFT REGISTER
        CMBTRIGL_t  CMBTRIGL;   ///< CMBTRIGL:    COMBINATIONAL TRIGGER REGISTER LOW
        CMBTRIGH_t  CMBTRIGH;   ///< CMBTRIGL:    COMBINATIONAL TRIGGER REGISTER HIGH
        LOGCONy_t   LOGCON_A;   ///< LOGCONA:     COMBINATORIAL PWM LOGIC CONTROL REGISTER A
        LOGCONy_t   LOGCON_B;   ///< LOGCONB:     COMBINATORIAL PWM LOGIC CONTROL REGISTER B
        LOGCONy_t   LOGCON_C;   ///< LOGCONC:     COMBINATORIAL PWM LOGIC CONTROL REGISTER C
        LOGCONy_t   LOGCON_D;   ///< LOGCOND:     COMBINATORIAL PWM LOGIC CONTROL REGISTER D
        LOGCONy_t   LOGCON_E;   ///< LOGCONE:     COMBINATORIAL PWM LOGIC CONTROL REGISTER E
        LOGCONy_t   LOGCON_F;   ///< LOGCONF:     COMBINATORIAL PWM LOGIC CONTROL REGISTER F
        PWMEVTy_t   PWMEVT_A;   ///< PWMEVTA:     PWM EVENT OUTPUT CONTROL REGISTER A
        PWMEVTy_t   PWMEVT_B;   ///< PWMEVTB:     PWM EVENT OUTPUT CONTROL REGISTER B
        PWMEVTy_t   PWMEVT_C;   ///< PWMEVTC:     PWM EVENT OUTPUT CONTROL REGISTER C
        PWMEVTy_t   PWMEVT_D;   ///< PWMEVTD:     PWM EVENT OUTPUT CONTROL REGISTER D
        PWMEVTy_t   PWMEVT_E;   ///< PWMEVTE:     PWM EVENT OUTPUT CONTROL REGISTER E
        PWMEVTy_t   PWMEVT_F;   ///< PWMEVTF:     PWM EVENT OUTPUT CONTROL REGISTER F

    } __attribute__((aligned)); ///< PWM MODULE SPECIAL FUNCTION REGISTER SET

    typedef struct P33C_PWM_MODULE_s P33C_PWM_MODULE_t; ///< PWM MODULE SPECIAL FUNCTION REGISTER SET DATA TYPE

    /*********************************************************************************
     * @ingroup p33c-pral-pwm-module-methods
     * @brief   Gets pointer to PWM module SFR set
     * @return  P33C_PWM_MODULE_t*: Pointer to PWM module base register data object
     *
     * @details
     *  This macro returns a pointer to the PWM module base register set.
     *  This pointer can be used to directly read from/write to the PWM
     *  Module base registers.
     *
     *********************************************************************************/
    #define p33c_PwmModule_GetHandle() (P33C_PWM_MODULE_t*)&PCLKCON ///< Captures memory address of first PWM module register

    /*********************************************************************************
     * @ingroup p33c-pral-pwm-module-methods
     * @brief   Gets pointer to APWM module SFR set
     * @return  P33C_PWM_MODULE_t*: Pointer to PWM module base register data object
     *
     * @details
     *  This macro returns a pointer to the APWM module base register set.
     *  This pointer can be used to directly read from/write to the APWM
     *  Module base registers.
     *
     *********************************************************************************/
    #ifdef APCLKCON
    #define p33c_ApwmModule_GetHandle() (P33C_PWM_MODULE_t*)&APCLKCON ///< Captures memory address of first APWM module register
    #endif

#endif

// ==========================================================
// GENERIC PWM GENERATOR SPECIAL FUNCTION REGISTERS
// ==========================================================

#ifndef P33C_PWM_INSTANCE_s

    /***********************************************************************************
     * @addtogroup p33c-pral-pwm-instance-inheritance
     * @extends P33C_PWM_MODULE_s
     * @{
     */

    /**
     * @brief   PWM Generator x Control Register (Low) inherited from device header file
     */
    union PGxCONL_u {
        struct tagPG1CONLBITS bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxCONH: PWM GENERATOR x CONTROL REGISTER LOW

    /**
     * @brief   PWM Generator x Control Register (High) inherited from device header file
     */
    union PGxCONH_u {
        struct tagPG1CONHBITS bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxCONH: PWM GENERATOR x CONTROL REGISTER HIGH

    /**
     * @brief   PWM Generator x Status Register inherited from device header file
     */
    union PGxSTAT_u {
        struct tagPG1STATBITS bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxSTAT: PWM GENERATOR x STATUS REGISTER

    /**
     * @brief   PWM Generator x Input/Output Control Register (Low) inherited from device header file
     */
    union PGxIOCONL_u {
        struct tagPG1IOCONLBITS bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxIOCONL: PWM GENERATOR x I/O CONTROL REGISTER LOW

    /**
     * @brief   PWM Generator x Input/Output Control Register (High) inherited from device header file
     */
    union PGxIOCONH_u {
        struct tagPG1IOCONHBITS bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxIOCONH: PWM GENERATOR x I/O CONTROL REGISTER HIGH

    /**
     * @brief   PWM Generator x Event Register (Low) inherited from device header file
     */
    union PGxEVTL_u {
        struct tagPG1EVTLBITS bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxEVTL: PWM GENERATOR x EVENT REGISTER LOW

    /**
     * @brief   PWM Generator x Event Register (High) inherited from device header file
     */
    union PGxEVTH_u {
        struct tagPG1EVTHBITS bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxEVTH: PWM GENERATOR x EVENT REGISTER HIGH

    /**
     * @brief   PWM Generator x PWM Control Input Register (Low) inherited from device header file
     */
    union PGxyPCIL_u {
        struct tagPG1FPCILBITS bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxFPCIL: PWM GENERATOR x PCI REGISTER LOW

    /**
     * @brief   PWM Generator x PWM Control Input Register (High) inherited from device header file
     */
    union PGxyPCIH_u {
        struct tagPG1FPCIHBITS bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxFPCIH: PWM GENERATOR x PCI REGISTER HIGH

    /**
     * @brief   PWM Generator x Leading Edge Blanking Register (Low) inherited from device header file
     */
    union PGxLEBL_u {
        struct {uint16_t LEBL : 16; } bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxLEBL: PWM GENERATOR x LEADING-EDGE BLANKING REGISTER LOW

    /**
     * @brief   PWM Generator x Leading Edge Blanking Register (High) inherited from device header file
     */
    union PGxLEBH_u {
        struct tagPG1LEBHBITS bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxLEBH: PWM GENERATOR x LEADING-EDGE BLANKING REGISTER HIGH

    /**
     * @brief   PWM Generator x Phase Register inherited from device header file
     */
    union PGxPHASE_u {
        struct { uint16_t PHASE : 16; } bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxPHASE: PWM GENERATOR x PHASE REGISTER

    /**
     * @brief   PWM Generator x Duty Cycle Register inherited from device header file
     */
    union PGxDC_u {
        struct { uint16_t DC : 16; } bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxDC: PWM GENERATOR x DUTY CYCLE REGISTER

    /**
     * @brief   PWM Generator x Duty Cycle Adjustment Register inherited from device header file
     */
    union PGxDCA_u {
        struct tagPG1DCABITS bits;  ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxDCA: PWM GENERATOR x DUTY CYCLE ADJUSTMENT REGISTER

    /**
     * @brief   PWM Generator x Period Register inherited from device header file
     */
    union PGxPER_u {
        struct { uint16_t PER : 16; } bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxPER: PWM GENERATOR x PERIOD REGISTER

    /**
     * @brief   PWM Generator x Trigger Register inherited from device header file
     */
    union PGxTRIGy_u {
        struct { uint16_t TRIG : 16; } bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxTRIGy: PWM GENERATOR x TRIGGER y REGISTER

    /**
     * @brief   PWM Generator x Dead Time Register (Low) inherited from device header file
     */
    union PGxDTL_u {
        struct tagPG1DTLBITS bits;  ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxDTL: PWM GENERATOR x DEAD-TIME REGISTER LOW

    /**
     * @brief   PWM Generator x Dead Time Register (High) inherited from device header file
     */
    union PGxDTH_u {
        struct tagPG1DTLBITS bits;  ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxDTL: PWM GENERATOR x DEAD-TIME REGISTER HIGH

    /**
     * @brief   PWM Generator x Capture Register inherited from device header file
     */
    union PGxCAP_u {
        struct { uint16_t CAP : 16; } bits; ///< Register bit-field
        uint16_t value;             ///< 16-bit wide register value
    } __attribute__((packed));      ///< PGxCAP: PWM GENERATOR x CAPTURE REGISTER

    /** @} */ // end of inheritance declarations **************************************

    typedef union PGxCONL_u PGxCONL_t;      ///< PGxCONH: PWM GENERATOR x CONTROL REGISTER LOW data type
    typedef union PGxCONH_u PGxCONH_t;      ///< PGxCONH: PWM GENERATOR x CONTROL REGISTER HIGH data type
    typedef union PGxSTAT_u PGxSTAT_t;      ///< PGxSTAT: PWM GENERATOR x STATUS REGISTER data type
    typedef union PGxIOCONL_u PGxIOCONL_t;  ///< PGxIOCONL: PWM GENERATOR x I/O CONTROL REGISTER LOW data type
    typedef union PGxIOCONH_u PGxIOCONH_t;  ///< PGxIOCONH: PWM GENERATOR x I/O CONTROL REGISTER HIGH data type
    typedef union PGxEVTL_u PGxEVTL_t;      ///< PGxEVTL: PWM GENERATOR x EVENT REGISTER LOW data type
    typedef union PGxEVTH_u PGxEVTH_t;      ///< PGxEVTH: PWM GENERATOR x EVENT REGISTER HIGH data type
    typedef union PGxyPCIL_u PGxyPCIL_t;    ///< PGxFPCIL: PWM GENERATOR x PCI REGISTER LOW data type
    typedef union PGxyPCIH_u PGxyPCIH_t;    ///< PGxFPCIH: PWM GENERATOR x PCI REGISTER HIGH data type
    typedef union PGxLEBL_u PGxLEBL_t;      ///< PGxLEBL: PWM GENERATOR x LEADING-EDGE BLANKING REGISTER LOW data type
    typedef union PGxLEBH_u PGxLEBH_t;      ///< PGxLEBH: PWM GENERATOR x LEADING-EDGE BLANKING REGISTER HIGH data type
    typedef union PGxPHASE_u PGxPHASE_t;    ///< PGxPHASE: PWM GENERATOR x PHASE REGISTER data type
    typedef union PGxDC_u PGxDC_t;          ///< PGxDC: PWM GENERATOR x DUTY CYCLE REGISTER data type
    typedef union PGxDCA_u PGxDCA_t;        ///< PGxDCA: PWM GENERATOR x DUTY CYCLE ADJUSTMENT REGISTER data type
    typedef union PGxPER_u PGxPER_t;        ///< PGxPER: PWM GENERATOR x PERIOD REGISTER data type
    typedef union PGxTRIGy_u PGxTRIGy_t;    ///< PGxTRIGy: PWM GENERATOR x TRIGGER y REGISTER data type
    typedef union PGxDTL_u PGxDTL_t;        ///< PGxDTL: PWM GENERATOR x DEAD-TIME REGISTER LOW data type
    typedef union PGxDTH_u PGxDTH_t;        ///< PGxDTL: PWM GENERATOR x DEAD-TIME REGISTER HIGH data type
    typedef union PGxCAP_u PGxCAP_t;        ///< PGxCAP: PWM GENERATOR x CAPTURE REGISTER data type

    /***********************************************************************************
     * @ingroup p33c-pral-pwm-instance-properties
     * @struct  P33C_PWM_INSTANCE_s
     * @brief   Abstracted set of Special Function Registers of the PWM peripheral module base registers
     * @details
     *  This structure defines an abstracted set of Special Function Registers of
     *  PWM generator configuration and control registers. Users can use this
     *  abstracted set of registers to capture register settings from or write
     *  generic register settings to these peripheral base registers.
     *
     **********************************************************************************/

    struct P33C_PWM_INSTANCE_s {

        PGxCONL_t   PGxCONL;    ///< PGxCONL:   PWM GENERATOR x CONTROL REGISTER HIGH
        PGxCONH_t   PGxCONH;    ///< PGxCONH:   PWM GENERATOR x CONTROL REGISTER HIGH
        PGxSTAT_t   PGxSTAT;    ///< PGxSTAT:   PWM GENERATOR x STATUS REGISTER
        PGxIOCONL_t PGxIOCONL;  ///< PGxIOCONL: PWM GENERATOR x I/O CONTROL REGISTER LOW
        PGxIOCONH_t PGxIOCONH;  ///< PGxIOCONH: PWM GENERATOR x I/O CONTROL REGISTER HIGH
        PGxEVTL_t   PGxEVTL;    ///< PGxEVTL:   PWM GENERATOR x EVENT REGISTER LOW
        PGxEVTH_t   PGxEVTH;    ///< PGxEVTH:   PWM GENERATOR x EVENT REGISTER HIGH
        PGxyPCIL_t  PGxFPCIL;   ///< PGxFPCIL:  PWM GENERATOR x FAULT PCI REGISTER LOW
        PGxyPCIH_t  PGxFPCIH;   ///< PGxFPCIH:  PWM GENERATOR x FAULT PCI REGISTER HIGH
        PGxyPCIL_t  PGxCLPCIL;  ///< PGxCLPCIL: PWM GENERATOR x CURRENT LIMIT PCI REGISTER LOW
        PGxyPCIH_t  PGxCLPCIH;  ///< PGxCLPCIH: PWM GENERATOR x CURRENT LIMIT PCI REGISTER HIGH
        PGxyPCIL_t  PGxFFPCIL;  ///< PGxFFPCIL: PWM GENERATOR x FEED FORWARD PCI REGISTER LOW
        PGxyPCIH_t  PGxFFPCIH;  ///< PGxFFPCIH: PWM GENERATOR x FEED FORWARD PCI REGISTER HIGH
        PGxyPCIL_t  PGxSPCIL;   ///< PGxSPCIL:  PWM GENERATOR x SOFTWARE PCI REGISTER LOW
        PGxyPCIH_t  PGxSPCIH;   ///< PGxSPCIH:  PWM GENERATOR x SOFTWARE PCI REGISTER HIGH
        PGxLEBL_t   PGxLEBL;    ///< PGxLEBL:   PWM GENERATOR x LEADING-EDGE BLANKING REGISTER LOW
        PGxLEBH_t   PGxLEBH;    ///< PGxLEBH:   PWM GENERATOR x LEADING-EDGE BLANKING REGISTER HIGH
        PGxPHASE_t  PGxPHASE;   ///< PGxPHASE:  PWM GENERATOR x PHASE REGISTER
        PGxDC_t     PGxDC;      ///< PGxDC:     PWM GENERATOR x DUTY CYCLE REGISTER
        PGxDCA_t    PGxDCA;     ///< PGxDCA:    PWM GENERATOR x DUTY CYCLE ADJUSTMENT REGISTER
        PGxPER_t    PGxPER;     ///< PGxPER:    PWM GENERATOR x PERIOD REGISTER
        PGxTRIGy_t  PGxTRIGA;   ///< PGxTRIGA:  PWM GENERATOR x TRIGGER A REGISTER
        PGxTRIGy_t  PGxTRIGB;   ///< PGxTRIGB:  PWM GENERATOR x TRIGGER B REGISTER
        PGxTRIGy_t  PGxTRIGC;   ///< PGxTRIGC:  PWM GENERATOR x TRIGGER C REGISTER
        PGxDTL_t    PGxDTL;     ///< PGxDTL:    PWM GENERATOR x DEAD-TIME REGISTER LOW
        PGxDTH_t    PGxDTH;     ///< PGxDTH:    PWM GENERATOR x DEAD-TIME REGISTER HIGH
        PGxCAP_t    PGxCAP;     ///< PGxCAP:    PWM GENERATOR x CAPTURE REGISTER

    } __attribute__((aligned)); ///< PWM GENERATOR INSTANCE SPECIAL FUNCTION REGISTER SET

