areiter128/pstpl-p33c-tdal/p33c_pral/exth/p33c_pwm-d.h
    typedef struct P33C_PWM_INSTANCE_s P33C_PWM_INSTANCE_t; ///< PWM GENERATOR INSTANCE SPECIAL FUNCTION REGISTER SET DATA TYPE

    /*********************************************************************************
     * @ingroup p33c-pral-pwm-instance-constants
     * @brief   Gets PWM generator instance Special Function Register set address offset
     * @return  Memory address offset between PWM generator instances in number of bytes
     *
     * @details
     *  This macro returns the address offset between PWM generator instances Special
     *  Function Register (SFR) sets allowing to calculate the relative distance between
     *  SFR addresses of two different PWM generators.
     *
     *********************************************************************************/
    #define P33C_PWMGEN_SFR_OFFSET  ((uint16_t)&PG2CONL - (uint16_t)&PG1CONL)

    /*********************************************************************************
    * @ingroup p33c-pral-pwm-instance-properties
    * @brief   Gets the number of available peripheral instances
    * @details
    *  This variable is used to determine the number of available instances of the
    *  peripheral by returning the number of array elements of the instance handle
    *  list.
    **********************************************************************************/
    static const uint16_t p33c_PwmInstances = (sizeof(p33c_PwmInstance_Handles)/sizeof(p33c_PwmInstance_Handles[0]));

    /*********************************************************************************
     * @ingroup p33c-pral-pwm-instance-methods
     * @brief   Gets a pointer to the start address of a PWM generator SFR block
     * @param   pInstance: Instance of the PWM generator of type unsigned integer (e.g. 1=PG1, 2=PG2, etc.)
     * @return  Pointer address to PWM generator instance of type P33C_PWM_GENERATOR_t specified by parameter pgInstance
     *
     * @details
     *  This function returns the pointer to a peripheral instance register set
     *  in Special Function Register memory space. This pointer can be used to
     *  directly write to/read from the Special Function Registers of the
     *  peripheral instance configuration.
     *
     * @note
     *  To maximize code execution performance, the declared peripheral instance
     *  index parameter is not validated. Hence, GetHandle could potentially return
     *  an invalid memory address with unclear consequences for the user firmware.
     *  Please use @ref p33c_PwmInstance_Exists() to validate the given peripheral
     *  instance parameter before using the the returned memory address.
     *
     * @see
     *  p33c_PwmInstance_Exists()
     *
     *********************************************************************************/
    #define p33c_PwmInstance_GetHandle(pInstance) (P33C_PWM_INSTANCE_t*)p33c_PwmInstance_Handles[(pInstance-1)]

    /*********************************************************************************
     * @ingroup p33c-pral-pwm-instance-methods
     * @brief   Checks if the peripheral instance specified by pInstance exists or not
     * @param   pInstance: Index of the peripheral instance of type unsigned integer
     * @return  true:  requested peripheral instance index does exist
     * @return  false: requested peripheral instance index does not exist
     *
     * @details
     *  This function provides a guarding condition test to verify if a specific
     *  peripheral instance exists before accessing it.
     *********************************************************************************/
    #define p33c_PwmInstance_Exists(pInstance) (bool)(((0 < pInstance) && (pInstance <= p33c_PwmInstances)) ? true : false)

#endif /* End of P33C_PWM_INSTANCE_s */
#endif /* End of P33C_PWM_SFR_DECLARATIONS_H */

// ______________________
// end of file
